Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
ROMMON emulation microcode.

                           Launching IOS image at 0x80008000...

                                                               Smart Init is disabled. IOMEM set to: 5  

                                                                                                        Using iomem percentage: 5

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
Image text-base: 0x60008930, data-base: 0x63652000


Original NVCONFIG doesnt have correct MAGIC number

Backup NVCONFIG also doesnt have correct MAGIC number

 BIST FAILED...
Unknown file system detected.
Use format command to format the card as DOS File System.
Or use erase command to format the card as Low End File System.

Unknown file system detected.
Use format command to format the card as DOS File System.
Or use erase command to format the card as Low End File System.

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 3725 (R7000) processor (revision 0.1) with 249856K/12288K bytes of memory.
Processor board ID FTX0945W0MY
R7000 CPU at 240MHz, Implementation 39, Rev 2.1, 256KB L2, 512KB L3 Cache
18 FastEthernet interfaces
DRAM configuration is 64 bits wide with parity enabled.
55K bytes of NVRAM.
131072K bytes of ATA System CompactFlash (Read/Write)
131072K bytes of ATA Slot0 CompactFlash (Read/Write)


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: Installed image archive

% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no


Press RETURN to get started!


*Mar  1 00:00:03.931: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar  1 00:00:03.935: %LINEPROTO-5-UPDOWN: Line protocol on Interface IPv6-mpls, changed state to up
*Mar  1 00:00:03.939: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:03.939: %LINK-3-UPDOWN: Interface FastEthernet1/1, changed state to down
*Mar  1 00:00:03.943: %LINK-3-UPDOWN: Interface FastEthernet1/2, changed state to down
*Mar  1 00:00:03.943: %LINK-3-UPDOWN: Interface FastEthernet1/3, changed state to down
*Mar  1 00:00:03.947: %LINK-3-UPDOWN: Interface FastEthernet1/4, changed state to down
*Mar  1 00:00:03.947: %LINK-3-UPDOWN: Interface FastEthernet1/5, changed state to down
*Mar  1 00:00:03.951: %LINK-3-UPDOWN: Interface FastEthernet1/6, changed state to down
*Mar  1 00:00:03.951: %LINK-3-UPDOWN: Interface FastEthernet1/7, changed state to down
*Mar  1 00:00:03.955: %LINK-3-UPDOWN: Interface FastEthernet1/8, changed state to down

Router>*Mar  1 00:00:03.955: %LINK-3-UPDOWN: Interface FastEthernet1/9, changed state to down
*Mar  1 00:00:03.959: %LINK-3-UPDOWN: Interface FastEthernet1/10, changed state to down
*Mar  1 00:00:03.959: %LINK-3-UPDOWN: Interface FastEthernet1/11, changed state to down
*Mar  1 00:00:03.963: %LINK-3-UPDOWN: Interface FastEthernet1/12, changed state to down
*Mar  1 00:00:03.963: %LINK-3-UPDOWN: Interface FastEthernet1/13, changed state to down
*Mar  1 00:00:03.967: %LINK-3-UPDOWN: Interface FastEthernet1/14, changed state to down
*Mar  1 00:00:03.967: %LINK-3-UPDOWN: Interface FastEthernet1/15, changed state to down
*Mar  1 00:00:04.939: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:04.939: %LINEPROTO-5-UPDOWN: 
Router>
Router>Line protocol on Interface FastEthernet1/1, changed state to down
*Mar  1 00:00:04.943: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/2, changed state to down
*Mar  1 00:00:04.943: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/3, changed state to down
*Mar  1 00:00:04.947: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/4, changed state to down
*Mar  1 00:00:04.947: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/5, changed state to down
*Mar  1 00:00:04.951: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/6, changed state to down
*Mar  1 00:00:04.951: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/7, changed state to down
*Mar  1 00:00:04.955: %LINEPROTO-5-UPDOWN: Line protoco
Router>
Router>
Router>l on Interface FastEthernet1/8, changed state to down
*Mar  1 00:00:04.955: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/9, changed state to down
*Mar  1 00:02:54.439: %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to administratively down
*Mar  1 00:02:54.555: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
*Mar  1 00:02:54.567: %SNMP-5-COLDSTART: SNMP agent on host Router is undergoing a cold start
*Mar  1 00:02:54.611: %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down
*Mar  1 00:02:54.627: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is OFF
*Mar  1 00:02:54.627: %CRYPTO-6-GDOI_ON_OFF: GDOI is OFF
*Mar  1 00:02:55.331: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
*Mar  1 00:02:55.439: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down
*Mar  1 00:02:55.611: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down
*Mar  1 00:02:57.111: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/15, changed state to up
*Mar  1 00:02:57.119: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/14, changed state to up
*Mar  1 00:02:57.123: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/13, changed state to up
*Mar  1 00:02:57.123: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/12, changed state to up
*Mar  1 00:02:57.123: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/11, changed state to up
*Mar  1 00:02:57.127: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/10, changed state to up
*Mar  1 00:02:57.127: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/9, changed state to up
*Mar  1 00:02:57.127: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/8, changed state to up
*Mar  1 00:02:57.131: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/7, changed state to up
*Mar  1 00:02:57.131: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/6, changed state to up
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hos
Router(config)#hostname R2
R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#line con 0
R2(config-line)#no exec-t
R2(config-line)#no exec-timeout 0
R2(config-line)#exit
R2(config)#no ip domain lookup
R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#do wr
Building configuration...
[OK]
R2(config)#
R2(config)#
R2(config)#
R2(config)#do terminal legnth 0
terminal legnth 0
           ^
% Invalid input detected at '^' marker.

R2(config)#444^Z           ^
% Invalid input detected at '^' marker.

R2#
R2#
R2#
R2#
*Mar  1 00:09:12.519: %SYS-5-CONFIG_I: Configured from console by console
R2#
R2#l=term
R2#ter   
R2#terminal le
R2#terminal length 0
R2#
R2#
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
R2#
R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#interface FastEthernet0/0
R2(config-if)# ip address 10.1.2.2 255.255.255.0
R2(config-if)# duplex auto
R2(config-if)# speed auto
R2(config-if)#!
R2(config-if)#interface FastEthernet0/1
R2(config-if)# ip address 10.2.3.3 255.255.255.0
R2(config-if)# duplex auto
R2(config-if)# speed auto
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#^Z
R2#
R2#
R2#
R2#wr
*Mar  1 00:15:03.151: %SYS-5-CONFIG_I: Configured from console by console
Building configuration...
[OK]
R2#
R2#
R2#sh run
Building configuration...

Current configuration : 1236 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
ip cef
!
!
!
!
no ip domain lookup
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
! 
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 10.1.2.2 255.255.255.0
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.2.3.3 255.255.255.0
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet1/0
!
interface FastEthernet1/1
!
interface FastEthernet1/2
!
interface FastEthernet1/3
!
interface FastEthernet1/4
!
interface FastEthernet1/5
!
interface FastEthernet1/6
!
interface FastEthernet1/7
!
interface FastEthernet1/8
!
interface FastEthernet1/9
!
interface FastEthernet1/10
!
interface FastEthernet1/11
!
interface FastEthernet1/12
!
interface FastEthernet1/13
!
interface FastEthernet1/14
!
interface FastEthernet1/15
!
interface Vlan1
 no ip address
!
ip forward-protocol nd
!
!
ip http server
no ip http secure-server
!
!
!
!
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
line aux 0
line vty 0 4
!
!
end

R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#interface FastEthernet0/1
R2(config-if)#no ip address 10.2.3.3 255.255.255.0 
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#interface FastEthernet0/1
R2(config-if)# ip address 10.2.3.2 255.255.255.0
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#^Z
R2#
R2#
R2#
R2#show i
*Mar  1 00:16:22.831: %SYS-5-CONFIG_I: Configured from console by consolep int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.2.2        YES manual administratively down down    
FastEthernet0/1            10.2.3.2        YES manual administratively down down    
FastEthernet1/0            unassigned      YES unset  up                    up      
FastEthernet1/1            unassigned      YES unset  up                    up      
FastEthernet1/2            unassigned      YES unset  up                    up      
FastEthernet1/3            unassigned      YES unset  up                    up      
FastEthernet1/4            unassigned      YES unset  up                    up      
FastEthernet1/5            unassigned      YES unset  up                    up      
FastEthernet1/6            unassigned      YES unset  up                    up      
FastEthernet1/7            unassigned      YES unset  up                    up      
FastEthernet1/8            unassigned      YES unset  up                    up      
FastEthernet1/9            unassigned      YES unset  up                    up      
FastEthernet1/10           unassigned      YES unset  up                    up      
FastEthernet1/11           unassigned      YES unset  up                    up      
FastEthernet1/12           unassigned      YES unset  up                    up      
FastEthernet1/13           unassigned      YES unset  up                    up      
FastEthernet1/14           unassigned      YES unset  up                    up      
FastEthernet1/15           unassigned      YES unset  up                    up      
Vlan1                      unassigned      YES unset  up                    up      
R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#in
R2(config)#interface r
R2(config)#interface range f
R2(config)#interface range fastEthernet 0/0-1
                                           ^
% Invalid input detected at '^' marker.

R2(config)#
R2(config)#
R2(config)#
R2(config)#in
R2(config)#interface f
R2(config)#interface fastEthernet 0/0
R2(config-if)#no shut
R2(config-if)#
*Mar  1 00:17:06.219: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:17:07.219: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to upexit
R2(config)#interface fastEthernet 0/1
R2(config-if)#no shut
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#^Z
R2#
R2#
*Mar  1 00:17:16.511: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
R2#
R2#show
*Mar  1 00:17:17.167: %SYS-5-CONFIG_I: Configured from console by console
*Mar  1 00:17:17.511: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up in=p int bri
          ^
% Invalid input detected at '^' marker.

R2#sh ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.2.2        YES manual up                    up      
FastEthernet0/1            10.2.3.2        YES manual up                    up      
FastEthernet1/0            unassigned      YES unset  up                    up      
FastEthernet1/1            unassigned      YES unset  up                    up      
FastEthernet1/2            unassigned      YES unset  up                    up      
FastEthernet1/3            unassigned      YES unset  up                    up      
FastEthernet1/4            unassigned      YES unset  up                    up      
FastEthernet1/5            unassigned      YES unset  up                    up      
FastEthernet1/6            unassigned      YES unset  up                    up      
FastEthernet1/7            unassigned      YES unset  up                    up      
FastEthernet1/8            unassigned      YES unset  up                    up      
FastEthernet1/9            unassigned      YES unset  up                    up      
FastEthernet1/10           unassigned      YES unset  up                    up      
FastEthernet1/11           unassigned      YES unset  up                    up      
FastEthernet1/12           unassigned      YES unset  up                    up      
FastEthernet1/13           unassigned      YES unset  up                    up      
FastEthernet1/14           unassigned      YES unset  up                    up      
FastEthernet1/15           unassigned      YES unset  up                    up      
Vlan1                      unassigned      YES unset  up                    up      
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bg
R2(config)#router bgp 200
R2(config-router)#nei
R2(config-router)#neighbor 10.1.2.1 re
R2(config-router)#neighbor 10.1.2.1 remot
R2(config-router)#neighbor 10.1.2.1 remote-as 100
R2(config-router)#
*Mar  1 00:27:47.071: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 Up 
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#nei
R2(config-router)#neighbor 10.2.3.2 rem
R2(config-router)#neighbor 10.2.3.2 remot
R2(config-router)#neighbor 10.2.3.2 remote-as 300
% Cannot configure the local system as neighbor
R2(config-router)#neighbor 10.2.3.3 remote-as 300
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
*Mar  1 00:29:23.211: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#^Z
R2#show bgp ipv4 unicast summary
BGP router identifier 10.2.3.2, local AS number 200
BGP table version is 1, main routing table version 1

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.2.1        4   100       7       7        1    0    0 00:04:49        0
10.2.3.3        4   300       7       7        1    0    0 00:03:13        0
R2#
*Mar  1 00:32:35.231: %SYS-5-CONFIG_I: Configured from console by console
R2#
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
R2#
R2#sh ip bgp
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#sh ip bgp
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#sh ip bgp | 1.1.1 
               ^
% Invalid input detected at '^' marker.

R2#show ip bgp
R2#show ip bgp | 1
                 ^
% Invalid input detected at '^' marker.

R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
R2#
R2#terminal length 0
R2#write
Building configuration...
[OK]
R2#quit





























































R2 con0 is now available





Press RETURN to get started.









R2>
R2>
R2>
R2>
R2>
R2>en
R2#show ip rou
R2#show ip route 1.1.1.1
Routing entry for 1.1.1.1/32
  Known via "bgp 200", distance 20, metric 0
  Tag 100, type external
  Last update from 10.1.2.1 00:04:47 ago
  Routing Descriptor Blocks:
  * 10.1.2.1, from 10.1.2.1, 00:04:47 ago
      Route metric is 0, traffic share count is 1
      AS Hops 1
      Route tag 100

R2#
R2#
R2#
R2#
R2#show ip bgp 1.1.1.1
BGP routing table entry for 1.1.1.1/32, version 13
Paths: (1 available, best #1, table Default-IP-Routing-Table)
Flag: 0x820
  Advertised to update-groups:
        1
  100
    10.1.2.1 from 10.1.2.1 (1.1.1.6)
      Origin incomplete, metric 0, localpref 100, valid, external, best
R2#
R2#
R2#sh run bgp
           ^
% Invalid input detected at '^' marker.

R2#show run
Building configuration...

Current configuration : 1362 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
ip cef
!
!
!
!
no ip domain lookup
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
! 
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 10.1.2.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.2.3.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
!
interface FastEthernet1/1
!         
interface FastEthernet1/2
!
interface FastEthernet1/3
!
interface FastEthernet1/4
!
interface FastEthernet1/5
!
interface FastEthernet1/6
!
interface FastEthernet1/7
!
interface FastEthernet1/8
!
interface FastEthernet1/9
!
interface FastEthernet1/10
!
interface FastEthernet1/11
!
interface FastEthernet1/12
!
interface FastEthernet1/13
!
interface FastEthernet1/14
!
interface FastEthernet1/15
!
interface Vlan1
 no ip address
!
router bgp 200
 no synchronization
 bgp log-neighbor-changes
 neighbor 10.1.2.1 remote-as 100
 neighbor 10.2.3.3 remote-as 300
 no auto-summary
!
ip forward-protocol nd
!
!
ip http server
no ip http secure-server
!
!
!         
!
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
line aux 0
line vty 0 4
!
!
end
          
R2#    
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)# no synchronization
R2(config-router)# bgp log-neighbor-changes
R2(config-router)# neighbor 10.1.2.1 remote-as 100
R2(config-router)# neighbor 10.1.2.1 eb           
R2(config-router)# neighbor 10.1.2.1 ebgp-multihop 4
R2(config-router)#neighbor 10.2.3.3 remote-as 300
R2(config-router)#neighbor 10.2.3.3 eb           
R2(config-router)#neighbor 10.2.3.3 ebgp-multihop 4
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#do wr
Building configuration...
[OK]
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#do wr
Building configuration...
[OK]
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#terminal length 0
                    ^
% Invalid input detected at '^' marker.

R2(config-router)#write
                  ^
% Invalid input detected at '^' marker.

R2(config-router)#quit
                  ^
% Invalid input detected at '^' marker.

Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
, traffic share count is 1
      AS Hops 1
      Route tag 100

R2#
R2#
R2#
R2#
R2#show ip bgp 1.1.1.1
BGP routing table entry for 1.1.1.1/32, version 13
Paths: (1 available, best #1, table Default-IP-Routing-Table)
Flag: 0x820
  Advertised to update-groups:
        1
  100
    10.1.2.1 from 10.1.2.1 (1.1.1.6)
      Origin incomplete, metric 0, localpref 100, valid, external, best
R2#
R2#
R2#sh run bgp
           ^
% Invalid input detected at '^' marker.

R2#show run
Building configuration...

Current configuration : 1362 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
ip cef
!
!
!
!
no ip domain lookup
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
! 
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 10.1.2.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.2.3.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
!
interface FastEthernet1/1
!         
interface FastEthernet1/2
!
interface FastEthernet1/3
!
interface FastEthernet1/4
!
interface FastEthernet1/5
!
interface FastEthernet1/6
!
interface FastEthernet1/7
!
interface FastEthernet1/8
!
interface FastEthernet1/9
!
interface FastEthernet1/10
!
interface FastEthernet1/11
!
interface FastEthernet1/12
!
interface FastEthernet1/13
!
interface FastEthernet1/14
!
interface FastEthernet1/15
!
interface Vlan1
 no ip address
!
router bgp 200
 no synchronization
 bgp log-neighbor-changes
 neighbor 10.1.2.1 remote-as 100
 neighbor 10.2.3.3 remote-as 300
 no auto-summary
!
ip forward-protocol nd
!
!
ip http server
no ip http secure-server
!
!
!         
!
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
line aux 0
line vty 0 4
!
!
end
          
R2#    
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)# no synchronization
R2(config-router)# bgp log-neighbor-changes
R2(config-router)# neighbor 10.1.2.1 remote-as 100
R2(config-router)# neighbor 10.1.2.1 eb           
R2(config-router)# neighbor 10.1.2.1 ebgp-multihop 4
R2(config-router)#neighbor 10.2.3.3 remote-as 300
R2(config-router)#neighbor 10.2.3.3 eb           
R2(config-router)#neighbor 10.2.3.3 ebgp-multihop 4
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#do wr
Building configuration...
[OK]
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#do wr
Building configuration...
[OK]
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#terminal length 0
                    ^
% Invalid input detected at '^' marker.

R2(config-router)#write
                  ^
% Invalid input detected at '^' marker.

R2(config-router)#quit
                  ^
% Invalid input detected at '^' marker.

R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#^Z
R2#
R2#
R2#show ip
*Mar  1 03:31:21.651: %SYS-5-CONFIG_I: Configured from console by console b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#show cdp nei
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            34          R S I     3725      Fas 0/0
R1               Fas 0/0            163         R S I     3725      Fas 0/0
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            27          R S I     3725      Fas 0/0
R1               Fas 0/0            156         R S I     3725      Fas 0/0
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            24          R S I     3725      Fas 0/0
R1               Fas 0/0            153         R S I     3725      Fas 0/0
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            19          R S I     3725      Fas 0/0
R1               Fas 0/0            148         R S I     3725      Fas 0/0
R2#
R2#
R2#
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            3           R S I     3725      Fas 0/0
R1               Fas 0/0            131         R S I     3725      Fas 0/0
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            0           R S I     3725      Fas 0/0
R1               Fas 0/0            127         R S I     3725      Fas 0/0
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R3               Fas 0/1            0           R S I     3725      Fas 0/0
R1               Fas 0/0            125         R S I     3725      Fas 0/0
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#show cdp neighbors 
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R1               Fas 0/0            120         R S I     3725      Fas 0/0
R2#
*Mar  1 03:33:23.447: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Down BGP Notification sent
*Mar  1 03:33:23.447: %BGP-3-NOTIFICATION: sent to neighbor 10.2.3.3 4/0 (hold time expired) 0 bytes 
R2#
R2#terminal length 0
R2#write
Building configuration...
[OK]
R2#quit





























































R2 con0 is now available





Press RETURN to get started.








*Mar  1 03:34:45.575: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2>
R2>
R2>
R2>
R2>
R2>en
R2#terminal length 0
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#show ip b
R2#clear ip bgp * so
R2#clear ip bgp * soft 
R2#
R2#
R2#
R2#
R2#show ip b           
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#sh run
Building configuration...

Current configuration : 1432 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
ip cef
!
!
!
!
no ip domain lookup
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
! 
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 10.1.2.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.2.3.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
!
interface FastEthernet1/1
!
interface FastEthernet1/2
!
interface FastEthernet1/3
!
interface FastEthernet1/4
!
interface FastEthernet1/5
!
interface FastEthernet1/6
!
interface FastEthernet1/7
!
interface FastEthernet1/8
!
interface FastEthernet1/9
!
interface FastEthernet1/10
!
interface FastEthernet1/11
!
interface FastEthernet1/12
!
interface FastEthernet1/13
!
interface FastEthernet1/14
!
interface FastEthernet1/15
!
interface Vlan1
 no ip address
!
router bgp 200
 no synchronization
 bgp log-neighbor-changes
 neighbor 10.1.2.1 remote-as 100
 neighbor 10.1.2.1 ebgp-multihop 4
 neighbor 10.2.3.3 remote-as 300
 neighbor 10.2.3.3 ebgp-multihop 4
 no auto-summary
!
ip forward-protocol nd
!
!
ip http server
no ip http secure-server
!
!
!
!
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
line aux 0
line vty 0 4
!
!
end

Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
clear ip bgp * so
R2#clear ip bgp * soft 
R2#
R2#
R2#
R2#
R2#show ip b           
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#sh run
Building configuration...

Current configuration : 1432 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
ip cef
!
!
!
!
no ip domain lookup
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
! 
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 10.1.2.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.2.3.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
!
interface FastEthernet1/1
!
interface FastEthernet1/2
!
interface FastEthernet1/3
!
interface FastEthernet1/4
!
interface FastEthernet1/5
!
interface FastEthernet1/6
!
interface FastEthernet1/7
!
interface FastEthernet1/8
!
interface FastEthernet1/9
!
interface FastEthernet1/10
!
interface FastEthernet1/11
!
interface FastEthernet1/12
!
interface FastEthernet1/13
!
interface FastEthernet1/14
!
interface FastEthernet1/15
!
interface Vlan1
 no ip address
!
router bgp 200
 no synchronization
 bgp log-neighbor-changes
 neighbor 10.1.2.1 remote-as 100
 neighbor 10.1.2.1 ebgp-multihop 4
 neighbor 10.2.3.3 remote-as 300
 neighbor 10.2.3.3 ebgp-multihop 4
 no auto-summary
!
ip forward-protocol nd
!
!
ip http server
no ip http secure-server
!
!
!
!
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
line aux 0
line vty 0 4
!
!
end

R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#show bgp ipv4 unicast 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
 NVRAM.
131072K bytes of ATA System CompactFlash (Read/Write)
131072K bytes of ATA Slot0 CompactFlash (Read/Write)
Installed image archive



Press RETURN to get started!


*Mar  1 00:00:04.087: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar  1 00:00:04.091: %LINEPROTO-5-UPDOWN: Line protocol on Interface IPv6-mpls, changed state to up
*Mar  1 00:00:04.095: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:04.095: %LINK-3-UPDOWN: Interface FastEthernet1/1, changed state to down
*Mar  1 00:00:04.099: %LINK-3-UPDOWN: Interface FastEthernet1/2, changed state to down
*Mar  1 00:00:04.099: %LINK-3-UPDOWN: Interface FastEthernet1/3, changed state to down
*Mar  1 00:00:04.103: %LINK-3-UPDOWN: Interface FastEthernet1/4, changed state to down
*Mar  1 00:00:04.103: %LINK-3-UPDOWN: Interface FastEthernet1/5, changed state to down
*Mar  1 00:00:04.107: %LINK-3-UPDOWN: Interface FastEthernet1/6, changed state to down
*Mar  1 00:00:04.107: %LINK-3-UPDOWN: Interface FastEthernet1/7, changed state to down
*Mar  1 00:00:04.111: %LINK-3-UPDOWN: Interface FastEthernet1/8, changed state to down
*Mar  1 00:00:04.111: %LINK-3-UPDOWN: Interface FastEthernet1/9, changed state to down
*Mar  1 00:00:04.111: %LINK-3-UPDOWN: Interface FastEthernet1/10, changed state to down
*Mar  1 00:00:04.115: %LINK-3-UPDOWN: Interface FastEthernet1/11, changed state to down
*Mar  1 00:00:04.115: %LINK-3-UPDOWN: Interface FastEthernet1/12, changed state to down
*Mar  1 00:00:04.119: %LINK-3-UPDOWN: Interface FastEthernet1/13, changed state to down
*Mar  1 00:00:04.119: %LINK-3-UPDOWN: Interface FastEthernet1/14, changed state to down
*Mar  1 00:00:04.123: %LINK-3-UPDOWN: Interface FastEthernet1/15, changed state to down
*Mar  1 00:00:04.643: %SYS-5-CONFIG_I: Configured from memory by console
*Mar  1 00:00:04.939: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
*Mar  1 00:00:04.955: %SNMP-5-COLDSTART: SNMP agent on host R2 is undergoing a cold start
*Mar  1 00:00:05.175: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 00:00:05.179: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:05.243: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is OFF
*Mar  1 00:00:05.243: %CRYPTO-6-GDOI_ON_OFF: GDOI is OFF
*Mar  1 00:00:06.055: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
*Mar  1 00:00:06.171: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
*Mar  1 00:00:06.179: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:07.651: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/15, changed state to up
*Mar  1 00:00:07.655: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/14, changed state to up
*Mar  1 00:00:07.663: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/13, changed state to up
*Mar  1 00:00:07.667: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/12, changed state to up
*Mar  1 00:00:07.671: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/11, changed state to up
*Mar  1 00:00:07.679: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/10, changed state to up
*Mar  1 00:00:07.683: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/9, changed state to up
*Mar  1 00:00:07.687: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/8, changed state to up
*Mar  1 00:00:07.687: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/7, changed state to up
*Mar  1 00:00:07.687: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/6, changed state to up
*Mar  1 00:00:36.279: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
*Mar  1 00:00:37.435: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 Up 
R2>
R2>
R2>
R2>
R2>
R2>
R2>
R2>
R2>en
R2#term
R2#terminal le
R2#terminal length 0
R2#
R2#
R2#
R2#
R2#sh ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#show bgp ipv3 uni
R2#show bgp ipv3 un 
R2#show bgp ipv3 unc
R2#show bgp ipv4 uni
R2#show bgp ipv4 unicast 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#show bgp ipv4 unicast summary
BGP router identifier 10.2.3.2, local AS number 200
BGP table version is 13, main routing table version 13
12 network entries using 1440 bytes of memory
12 path entries using 624 bytes of memory
2/1 BGP path/bestpath attribute entries using 248 bytes of memory
1 BGP AS-PATH entries using 24 bytes of memory
0 BGP route-map cache entries using 0 bytes of memory
0 BGP filter-list cache entries using 0 bytes of memory
Bitfield cache entries: current 1 (at peak 1) using 32 bytes of memory
BGP using 2368 total bytes of memory
BGP activity 12/0 prefixes, 12/0 paths, scan interval 60 secs

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.2.1        4   100      12      12       13    0    0 00:08:58       12
10.2.3.3        4   300      12      12       13    0    0 00:09:00        0
R2#
R2#
R2#
R2#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/20/24 ms
R2#
R2#
R2#sh run
Building configuration...

Current configuration : 1439 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
ip cef
!
!
!
!
no ip domain lookup
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
! 
!
!
!
!
!
!
!
interface FastEthernet0/0
 ip address 10.1.2.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet0/1
 ip address 10.2.3.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
!
interface FastEthernet1/1
!
interface FastEthernet1/2
!
interface FastEthernet1/3
!
interface FastEthernet1/4
!
interface FastEthernet1/5
!
interface FastEthernet1/6
!
interface FastEthernet1/7
!
interface FastEthernet1/8
!
interface FastEthernet1/9
!
interface FastEthernet1/10
!
interface FastEthernet1/11
!
interface FastEthernet1/12
!
interface FastEthernet1/13
!
interface FastEthernet1/14
!
interface FastEthernet1/15
!
interface Vlan1
 no ip address
!
router bgp 200
 no synchronization
 bgp log-neighbor-changes
 neighbor 10.1.2.1 remote-as 100
 neighbor 10.1.2.1 ebgp-multihop 4
 neighbor 10.2.3.3 remote-as 300
 neighbor 10.2.3.3 ebgp-multihop 4
 no auto-summary
!
ip forward-protocol nd
!
!
ip http server
no ip http secure-server
!
!
!
!
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
line aux 0
line vty 0 4
 login
!
!
end

R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#sh ip b
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#show ip b 
R2#show ip b 
R2#show ip bgp nei
R2#show ip bgp neighbors 10.1.2.1 ad
R2#show ip bgp neighbors 10.1.2.1 advertised-routes 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?

Total number of prefixes 12 
R2#show ip bgp neighbors 10.2.3.3 advertised-routes 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?

Total number of prefixes 12 
R2#
R2#
R2#
R2#
R2#
R2#sh ip ro
R2#sh ip route 
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     1.0.0.0/8 is variably subnetted, 12 subnets, 7 masks
B       1.1.1.1/32 [20/0] via 10.1.2.1, 00:16:26
B       1.1.1.3/32 [20/0] via 10.1.2.1, 00:16:26
B       1.1.1.2/32 [20/0] via 10.1.2.1, 00:16:26
B       1.1.1.5/32 [20/0] via 10.1.2.1, 00:16:26
B       1.1.1.4/32 [20/0] via 10.1.2.1, 00:16:26
B       1.1.7.0/30 [20/0] via 10.1.2.1, 00:16:26
B       1.1.1.6/32 [20/0] via 10.1.2.1, 00:16:26
B       1.1.8.0/29 [20/0] via 10.1.2.1, 00:16:26
B       1.1.9.0/28 [20/0] via 10.1.2.1, 00:16:26
B       1.1.10.0/27 [20/0] via 10.1.2.1, 00:16:28
B       1.1.11.0/26 [20/0] via 10.1.2.1, 00:16:28
B       1.1.12.0/25 [20/0] via 10.1.2.1, 00:16:28
     10.0.0.0/24 is subnetted, 2 subnets
C       10.1.2.0 is directly connected, FastEthernet0/0
C       10.2.3.0 is directly connected, FastEthernet0/1
R2#sh ip b     
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#rou
R2(config)#no router bgp 200 
R2(config)#
*Mar  1 00:39:30.911: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 Down BGP protocol initialization
*Mar  1 00:39:30.911: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Down BGP protocol initialization
R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#^Z
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
*Mar  1 00:39:33.823: %SYS-5-CONFIG_I: Configured from console by console
R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#nei
R2(config-router)#neighbor 10.1.2.1 re
R2(config-router)#neighbor 10.1.2.1 remot
R2(config-router)#neighbor 10.1.2.1 remote-as 100
R2(config-router)#
R2(config-router)#neighbor 10.1.2.1 eb           
R2(config-router)#neighbor 10.1.2.1 ebgp-multihop ?
  <1-255>  maximum hop count
  <cr>

R2(config-router)#neighbor 10.1.2.1 ebgp-multihop 8
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#nei
R2(config-router)#neighbor 10.3.
*Mar  1 00:40:28.615: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 U2 
R2(config-router)#neighbor 10.2
R2(config-router)#neighbor 10.2.3.3 re
R2(config-router)#neighbor 10.2.3.3 remot
R2(config-router)#neighbor 10.2.3.3 remote-as 300
R2(config-router)#neighbor 10.2.3.3 e            
R2(config-router)#neighbor 10.2.3.3 ebgp-multihop 8
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#^Z
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
*Mar  1 00:40:53.023: %SYS-5-CONFIG_I: Configured from console by console
R2#
R2#
R2#sho io
*Mar  1 00:40:59.931: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2#sho io
R2#sho io
R2#sho ip b
R2#sho ip bgp 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*  1.1.1.3/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.4/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.5/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.6/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#sho ip bgp 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*  1.1.1.3/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.4/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.5/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.6/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/20/20 ms
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
:59.931: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2#sho io
R2#sho io
R2#sho ip b
R2#sho ip bgp 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*  1.1.1.3/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.4/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.5/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.6/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#sho ip bgp 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*  1.1.1.3/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.4/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.5/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.6/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/20/20 ms
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#rcpnf t
    ^
% Invalid input detected at '^' marker.

R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#red
R2(config-router)#redistribute con
R2(config-router)#redistribute connected 
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
*Mar  1 01:43:00.343: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Down BGP Notification sent
*Mar  1 01:43:00.343: %BGP-3-NOTIFICATION: sent to neighbor 10.2.3.3 4/0 (hold time expired) 0 bytes 
*Mar  1 01:56:21.151: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
               10.1.2.1                 0             0 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#sho ip bgp 
BGP table version is 13, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*  1.1.1.3/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.4/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.5/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.1.6/32       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*>                  10.1.2.1                 0             0 100 ?
R2#
R2#
R2#
R2#
R2#
R2#ping 1.1.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 20/20/20 ms
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#rcpnf t
    ^
% Invalid input detected at '^' marker.

R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#red
R2(config-router)#redistribute con
R2(config-router)#redistribute connected 
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
*Mar  1 01:43:00.343: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Down BGP Notification sent
*Mar  1 01:43:00.343: %BGP-3-NOTIFICATION: sent to neighbor 10.2.3.3 4/0 (hold time expired) 0 bytes 
*Mar  1 01:56:21.151: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
1, 256KB L2, 512KB L3 Cache
18 FastEthernet interfaces
DRAM configuration is 64 bits wide with parity enabled.
55K bytes of NVRAM.
131072K bytes of ATA System CompactFlash (Read/Write)
131072K bytes of ATA Slot0 CompactFlash (Read/Write)
Installed image archive



Press RETURN to get started!


*Mar  1 00:00:04.263: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar  1 00:00:04.267: %LINEPROTO-5-UPDOWN: Line protocol on Interface IPv6-mpls, changed state to up
*Mar  1 00:00:04.267: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:04.271: %LINK-3-UPDOWN: Interface FastEthernet1/1, changed state to down
*Mar  1 00:00:04.271: %LINK-3-UPDOWN: Interface FastEthernet1/2, changed state to down
*Mar  1 00:00:04.275: %LINK-3-UPDOWN: Interface FastEthernet1/3, changed state to down
*Mar  1 00:00:04.275: %LINK-3-UPDOWN: Interface FastEthernet1/4, changed state to down
*Mar  1 00:00:04.279: %LINK-3-UPDOWN: Interface FastEthernet1/5, changed state to down
*Mar  1 00:00:04.279: %LINK-3-UPDOWN: Interface FastEthernet1/6, changed state to down
*Mar  1 00:00:04.283: %LINK-3-UPDOWN: Interface FastEthernet1/7, changed state to down
*Mar  1 00:00:04.283: %LINK-3-UPDOWN: Interface FastEthernet1/8, changed state to down
*Mar  1 00:00:04.287: %LINK-3-UPDOWN: Interface FastEthernet1/9, changed state to down
*Mar  1 00:00:04.287: %LINK-3-UPDOWN: Interface FastEthernet1/10, changed state to down
*Mar  1 00:00:04.291: %LINK-3-UPDOWN: Interface FastEthernet1/11, changed state to down
*Mar  1 00:00:04.291: %LINK-3-UPDOWN: Interface FastEthernet1/12, changed state to down
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/13, changed state to down
*Mar  1 00:00:04.295: %LINK-3-UPDOWN: Interface FastEthernet1/14, changed state to down
*Mar  1 00:00:04.299: %LINK-3-UPDOWN: Interface FastEthernet1/15, changed state to down
*Mar  1 00:00:04.923: %SYS-5-CONFIG_I: Configured from memory by console
*Mar  1 00:00:05.183: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 00:00:05.187: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:05.531: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
*Mar  1 00:00:05.547: %SNMP-5-COLDSTART: SNMP agent on host R2 is undergoing a cold start
*Mar  1 00:00:05.659: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is OFF
*Mar  1 00:00:05.659: %CRYPTO-6-GDOI_ON_OFF: GDOI is OFF
*Mar  1 00:00:06.183: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
*Mar  1 00:00:06.187: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:06.283: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
*Mar  1 00:00:07.939: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/15, changed state to up
*Mar  1 00:00:07.943: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/14, changed state to up
*Mar  1 00:00:07.951: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/13, changed state to up
*Mar  1 00:00:07.955: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/12, changed state to up
*Mar  1 00:00:07.959: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/11, changed state to up
*Mar  1 00:00:07.963: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/10, changed state to up
*Mar  1 00:00:07.971: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/9, changed state to up
*Mar  1 00:00:07.975: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/8, changed state to up
*Mar  1 00:00:07.979: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/7, changed state to up
*Mar  1 00:00:07.987: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/6, changed state to up
*Mar  1 00:00:34.719: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
*Mar  1 00:00:39.163: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 Up 
R2>
R2>
R2>
R2>en
R2#terminal length 0
R2#
R2#
R2#
R2#sh ip b
BGP table version is 16, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*> 10.1.2.0/24      0.0.0.0                  0         32768 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*  10.3.4.0/24      10.1.2.1                               0 100 400 300 ?
*>                  10.2.3.3                 0             0 300 ?
R2#
R2#
R2#
R2#sh ip b
BGP table version is 16, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*> 10.1.2.0/24      0.0.0.0                  0         32768 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*  10.3.4.0/24      10.1.2.1                               0 100 400 300 ?
*>                  10.2.3.3                 0             0 300 ?
R2#show bgp ipv4 unicast summary
BGP router identifier 10.2.3.2, local AS number 200
BGP table version is 16, main routing table version 16
15 network entries using 1800 bytes of memory
17 path entries using 884 bytes of memory
5/3 BGP path/bestpath attribute entries using 620 bytes of memory
3 BGP AS-PATH entries using 72 bytes of memory
0 BGP route-map cache entries using 0 bytes of memory
0 BGP filter-list cache entries using 0 bytes of memory
Bitfield cache entries: current 1 (at peak 1) using 32 bytes of memory
BGP using 3408 total bytes of memory
BGP activity 15/0 prefixes, 18/1 paths, scan interval 60 secs

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.2.1        4   100       7       7       16    0    0 00:01:43       13
10.2.3.3        4   300       7       7       16    0    0 00:01:47        2
R2#
R2#
R2#
R2#show bgp ipv4 unicast 
BGP table version is 16, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*> 10.1.2.0/24      0.0.0.0                  0         32768 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*  10.3.4.0/24      10.1.2.1                               0 100 400 300 ?
*>                  10.2.3.3                 0             0 300 ?
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
ROMMON emulation microcode.

                           Launching IOS image at 0x80008000...

                                                               Smart Init is disabled. IOMEM set to: 5  

                                                                                                        Using iomem percentage: 5

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
Image text-base: 0x60008930, data-base: 0x63652000


Original NVCONFIG doesnt have correct MAGIC number

Backup NVCONFIG also doesnt have correct MAGIC number

 BIST FAILED...
Unknown file system detected.
Use format command to format the card as DOS File System.
Or use erase command to format the card as Low End File System.

Unknown file system detected.
Use format command to format the card as DOS File System.
Or use erase command to format the card as Low End File System.

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 3725 (R7000) processor (revision 0.1) with 249856K/12288K bytes of memory.
Processor board ID FTX0945W0MY
R7000 CPU at 240MHz, Implementation 39, Rev 2.1, 256KB L2, 512KB L3 Cache
2 FastEthernet interfaces
DRAM configuration is 64 bits wide with parity enabled.
55K bytes of NVRAM.
131072K bytes of ATA System CompactFlash (Read/Write)
131072K bytes of ATA Slot0 CompactFlash (Read/Write)


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: Installed image archive

% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no


Press RETURN to get started!


*Mar  1 00:00:03.951: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar  1 00:00:03.955: %LINEPROTO-5-UPDOWN: Line protocol on Interface IPv6-mpls, changed state to up
*Mar  1 00:01:23.667: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
*Mar  1 00:01:23.675: %SNMP-5-COLDSTART: SNMP agent on host Router is undergoing a cold start
*Mar  1 00:01:23.715: %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to administratively down
*Mar  1 00:01:23.715: %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down
*Mar  1 00:01:23.727: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is OFF
*Mar  1 00:01:23.727: %CRYPTO-6-GDOI_ON_OFF: GDOI is OFF
*Mar  1 00:01:24.711: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down
*Mar  1 00:01:24.715: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down
Router>
Router>
Router>
Router>
Router>
Router>e
% Ambiguous command:  "e"
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#!
Router(config)#version 12.4
Router(config)#service timestamps debug datetime msec
Router(config)#service timestamps log datetime msec
Router(config)#no service password-encryption
Router(config)#!
Router(config)#hostname R2
R2(config)#!
R2(config)#boot-start-marker
R2(config)#boot-end-marker
R2(config)#!
R2(config)#!
R2(config)#no aaa new-model
R2(config)#memory-size iomem 5
R2(config)#ip cef
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#no ip domain lookup
R2(config)#!
R2(config)#multilink bundle-name authenticated
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#archive
R2(config-archive)# log config
R2(config-archive-log-cfg)#  hidekeys
R2(config-archive-log-cfg)#! 
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#!
R2(config-archive-log-cfg)#interface FastEthernet0/0
R2(config-if)# ip address 10.1.2.2 255.255.255.0
R2(config-if)# duplex auto
R2(config-if)# speed auto
R2(config-if)#!
R2(config-if)#interface FastEthernet0/1
R2(config-if)# ip address 10.2.3.2 255.255.255.0
R2(config-if)# duplex auto
R2(config-if)# speed auto
R2(config-if)#!
R2(config-if)#interface FastEthernet1/0
                        ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/1
                     ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/2
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/3
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/4
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/5
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/6
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/7
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/8
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/9
                                   ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/10
                                    ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/11
                                    ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/12
                                    ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/13
                                    ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/14
                                    ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface FastEthernet1/15
                                    ^
% Invalid input detected at '^' marker.

R2(config)#!
R2(config)#interface Vlan1
                      ^
% Invalid input detected at '^' marker.

R2(config)# no ip address
% Incomplete command.

R2(config)#!
R2(config)#router bgp 200
R2(config-router)# no synchronization
R2(config-router)# bgp log-neighbor-changes
R2(config-router)# redistribute connected
R2(config-router)# neighbor 10.1.2.1 remote-as 100
R2(config-router)# neighbor 10.1.2.1 ebgp-multihop 8
R2(config-router)# neighbor 10.2.3.3 remote-as 300
R2(config-router)# neighbor 10.2.3.3 ebgp-multihop 8
R2(config-router)# no auto-summary
R2(config-router)#!
R2(config-router)#ip forward-protocol nd
R2(config)#!
R2(config)#!
R2(config)#ip http server
R2(config)#no ip http secure-server
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#!
R2(config)#control-plane
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#!
R2(config-cp)#line con 0
R2(config-line)# exec-timeout 0 0
R2(config-line)#line aux 0
R2(config-line)#line vty 0 4
R2(config-line)# login
% Login disabled on line 98, until 'password' is set
% Login disabled on line 99, until 'password' is set
% Login disabled on line 100, until 'password' is set
% Login disabled on line 101, until 'password' is set
% Login disabled on line 102, until 'password' is set
R2(config-line)#!
R2(config-line)#!
R2(config-line)#end
R2#
R2#
R2#
R2#
R2#
*Mar  1 00:02:19.791: %SYS-5-CONFIG_I: Configured from console by consolewr
Building configuration...
[OK]
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#int f
R2(config)#int fastEthernet 0/0
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#no shut
R2(config-if)#
R2(config-if)#
R2(config-if)#exit
R2(config)#int fastEthernet 0/0
*Mar  1 00:04:32.719: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:04:33.719: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to u1
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#no shut
R2(config-if)#
R2(config-if)#
R2(config-if)#
R2(config-if)#^Z
R2#
R2#
R2#
R2#shw
*Mar  1 00:04:37.587: %SYS-5-CONFIG_I: Configured from console by console i
*Mar  1 00:04:38.767: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 00:04:39.767: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to upp 
R2#shw ip int bri
     ^
% Invalid input detected at '^' marker.

R2#show ip int bri
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.1.2.2        YES manual up                    up      
FastEthernet0/1            10.2.3.2        YES manual up                    up      
R2#
*Mar  1 00:05:01.259: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 Up 
*Mar  1 00:05:48.127: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
R2#
R2#
R2#
R2#
R2#terminal length 0
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 17, local router ID is 10.1.2.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*  10.1.2.0/24      10.1.2.1                 0             0 100 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.1.4.0/24      10.1.2.1                 0             0 100 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.3.4.0/24      10.2.3.3                 0             0 300 ?
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 17, local router ID is 10.1.2.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*  10.1.2.0/24      10.1.2.1                 0             0 100 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.1.4.0/24      10.1.2.1                 0             0 100 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.3.4.0/24      10.2.3.3                 0             0 300 ?
R2#wr
Building configuration...
[OK]
R2#
R2#
R2#terminal length 0
R2#write
Building configuration...
[OK]
R2#quit





























































R2 con0 is now available





Press RETURN to get started.













Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
ROMMON emulation microcode.

                           Launching IOS image at 0x80008000...

                                                               Smart Init is disabled. IOMEM set to: 5  

                                                                                                        Using iomem percentage: 5

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
Image text-base: 0x60008930, data-base: 0x63652000


 BIST FAILED...
Unknown file system detected.
Use format command to format the card as DOS File System.
Or use erase command to format the card as Low End File System.

Unknown file system detected.
Use format command to format the card as DOS File System.
Or use erase command to format the card as Low End File System.

This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 3725 (R7000) processor (revision 0.1) with 249856K/12288K bytes of memory.
Processor board ID FTX0945W0MY
R7000 CPU at 240MHz, Implementation 39, Rev 2.1, 256KB L2, 512KB L3 Cache
2 FastEthernet interfaces
DRAM configuration is 64 bits wide with parity enabled.
55K bytes of NVRAM.
131072K bytes of ATA System CompactFlash (Read/Write)
131072K bytes of ATA Slot0 CompactFlash (Read/Write)
Installed image archive



Press RETURN to get started!


*Mar  1 00:00:03.687: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar  1 00:00:03.691: %LINEPROTO-5-UPDOWN: Line protocol on Interface IPv6-mpls, changed state to up
*Mar  1 00:00:04.063: %SYS-5-CONFIG_I: Configured from memory by console
*Mar  1 00:00:04.171: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Mar  1 00:00:04.175: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:04.311: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3700 Software (C3725-ADVENTERPRISEK9-M), Version 12.4(15)T7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Wed 13-Aug-08 21:36 by prod_rel_team
*Mar  1 00:00:04.323: %SNMP-5-COLDSTART: SNMP agent on host R2 is undergoing a cold start
*Mar  1 00:00:04.407: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is OFF
*Mar  1 00:00:04.407: %CRYPTO-6-GDOI_ON_OFF: GDOI is OFF
*Mar  1 00:00:05.171: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
*Mar  1 00:00:05.175: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R2>
R2>
R2>
R2>
R2>
R2>en
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
*Mar  1 00:00:34.719: %BGP-5-ADJCHANGE: neighbor 10.2.3.3 Up 
*Mar  1 00:00:37.827: %BGP-5-ADJCHANGE: neighbor 10.1.2.1 Up 
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 1, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*  1.1.1.1/32       10.2.3.3                               0 300 400 100 ?
*  1.1.1.2/32       10.2.3.3                               0 300 400 100 ?
*  1.1.1.3/32       10.2.3.3                               0 300 400 100 ?
*  1.1.1.4/32       10.2.3.3                               0 300 400 100 ?
*  1.1.1.5/32       10.2.3.3                               0 300 400 100 ?
*  1.1.1.6/32       10.2.3.3                               0 300 400 100 ?
*  1.1.7.0/30       10.2.3.3                               0 300 400 100 ?
*  1.1.8.0/29       10.2.3.3                               0 300 400 100 ?
*  1.1.9.0/28       10.2.3.3                               0 300 400 100 ?
*  1.1.10.0/27      10.2.3.3                               0 300 400 100 ?
*  1.1.11.0/26      10.2.3.3                               0 300 400 100 ?
*  1.1.12.0/25      10.2.3.3                               0 300 400 100 ?
*  10.1.2.0/24      10.2.3.3                               0 300 400 100 ?
*                   0.0.0.0                  0         32768 ?
*  10.1.4.0/24      10.2.3.3                               0 300 400 100 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*                   0.0.0.0                  0         32768 ?
   Network          Next Hop            Metric LocPrf Weight Path
*  10.3.4.0/24      10.2.3.3                 0             0 300 ?
R2#ter
R2#terminal le
R2#terminal length 0
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 17, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*  10.1.2.0/24      10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.1.4.0/24      10.1.2.1                 0             0 100 ?
*                   10.2.3.3                               0 300 400 100 ?
*  10.2.3.0/24      10.1.2.1                               0 100 400 300 ?
*                   10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*  10.3.4.0/24      10.1.2.1                               0 100 400 300 ?
*>                  10.2.3.3                 0             0 300 ?
R2#terminal length 0
R2#
R2#
R2#show bgp ipv4 unicast 
BGP table version is 17, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.2/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.3/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.4/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.5/32       10.1.2.1                 0             0 100 ?
*> 1.1.1.6/32       10.1.2.1                 0             0 100 ?
*> 1.1.7.0/30       10.1.2.1                 0             0 100 ?
*> 1.1.8.0/29       10.1.2.1                 0             0 100 ?
*> 1.1.9.0/28       10.1.2.1                 0             0 100 ?
*> 1.1.10.0/27      10.1.2.1                 0             0 100 ?
*> 1.1.11.0/26      10.1.2.1                 0             0 100 ?
*> 1.1.12.0/25      10.1.2.1                 0             0 100 ?
*  10.1.2.0/24      10.1.2.1                 0             0 100 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.1.4.0/24      10.1.2.1                 0             0 100 ?
*  10.2.3.0/24      10.2.3.3                 0             0 300 ?
*>                  0.0.0.0                  0         32768 ?
*> 10.3.4.0/24      10.2.3.3                 0             0 300 ?
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 100
BGP is already running; AS is 200
R2(config)#no redistribute connected 
                ^
% Invalid input detected at '^' marker.

R2(config)#
R2(config)#
R2(config)#
R2(config)#
R2(config)#1conf t
           ^
% Invalid input detected at '^' marker.

R2(config)#router bgp 200
R2(config-router)#no redistribute connected 
R2(config-router)#^Z
R2#
R2#
R2#
R2#w
*Mar  1 00:07:55.399: %SYS-5-CONFIG_I: Configured from console by consoler
Building configuration...
[OK]
R2#
R2#
R2#
R2#
R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)#network 10.0.0.0
R2(config-router)#^Z
R2#wr
Building configuration...

*Mar  1 00:10:19.107: %SYS-5-CONFIG_I: Configured from console by console[OK]
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 37, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
r> 10.1.2.0/24      10.1.2.1                 0             0 100 i
R2#
R2#
R2#
R2#
R2#
R2#
R2#cof t
     ^
% Invalid input detected at '^' marker.

R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router bgp 200
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#no network 10.0.0.0
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#net
R2(config-router)#network 10.1.2.0 ma
R2(config-router)#network 10.1.2.0 mask 255.255.255.0
R2(config-router)#
R2(config-router)#
R2(config-router)#network 10.2.3.0 mask 255.255.255.0
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#
R2(config-router)#^Z
R2#
R2#
R2#
R2#show i
*Mar  1 00:19:44.975: %SYS-5-CONFIG_I: Configured from console by consolep b
BGP table version is 48, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 i
*> 1.1.1.2/32       10.1.2.1                 0             0 100 i
*> 1.1.1.3/32       10.1.2.1                 0             0 100 i
*> 1.1.1.4/32       10.1.2.1                 0             0 100 i
*> 1.1.1.5/32       10.1.2.1                 0             0 100 i
*> 1.1.1.6/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 48, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 i
*> 1.1.1.2/32       10.1.2.1                 0             0 100 i
*> 1.1.1.3/32       10.1.2.1                 0             0 100 i
*> 1.1.1.4/32       10.1.2.1                 0             0 100 i
*> 1.1.1.5/32       10.1.2.1                 0             0 100 i
*> 1.1.1.6/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 53, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 i
*> 1.1.1.2/32       10.1.2.1                 0             0 100 i
*> 1.1.1.3/32       10.1.2.1                 0             0 100 i
*> 1.1.1.4/32       10.1.2.1                 0             0 100 i
*> 1.1.1.5/32       10.1.2.1                 0             0 100 i
*> 1.1.1.6/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 1.1.8.0/29       10.1.2.1                 0             0 100 i
*> 1.1.9.0/28       10.1.2.1                 0             0 100 i
*> 1.1.10.0/27      10.1.2.1                 0             0 100 i
*> 1.1.11.0/26      10.1.2.1                 0             0 100 i
*> 1.1.12.0/25      10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 53, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 i
*> 1.1.1.2/32       10.1.2.1                 0             0 100 i
*> 1.1.1.3/32       10.1.2.1                 0             0 100 i
*> 1.1.1.4/32       10.1.2.1                 0             0 100 i
*> 1.1.1.5/32       10.1.2.1                 0             0 100 i
*> 1.1.1.6/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 1.1.8.0/29       10.1.2.1                 0             0 100 i
*> 1.1.9.0/28       10.1.2.1                 0             0 100 i
*> 1.1.10.0/27      10.1.2.1                 0             0 100 i
*> 1.1.11.0/26      10.1.2.1                 0             0 100 i
*> 1.1.12.0/25      10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#wr
Building configuration...
[OK]
Connected to Dynamips VM "R2" (ID 2, type c3725) - Console port
Press ENTER to get the prompt.
/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 53, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 i
*> 1.1.1.2/32       10.1.2.1                 0             0 100 i
*> 1.1.1.3/32       10.1.2.1                 0             0 100 i
*> 1.1.1.4/32       10.1.2.1                 0             0 100 i
*> 1.1.1.5/32       10.1.2.1                 0             0 100 i
*> 1.1.1.6/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 1.1.8.0/29       10.1.2.1                 0             0 100 i
*> 1.1.9.0/28       10.1.2.1                 0             0 100 i
*> 1.1.10.0/27      10.1.2.1                 0             0 100 i
*> 1.1.11.0/26      10.1.2.1                 0             0 100 i
*> 1.1.12.0/25      10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#
R2#show ip b
BGP table version is 53, local router ID is 10.2.3.2
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal,
              r RIB-failure, S Stale
Origin codes: i - IGP, e - EGP, ? - incomplete

   Network          Next Hop            Metric LocPrf Weight Path
*> 1.1.1.1/32       10.1.2.1                 0             0 100 i
*> 1.1.1.2/32       10.1.2.1                 0             0 100 i
*> 1.1.1.3/32       10.1.2.1                 0             0 100 i
*> 1.1.1.4/32       10.1.2.1                 0             0 100 i
*> 1.1.1.5/32       10.1.2.1                 0             0 100 i
*> 1.1.1.6/32       10.1.2.1                 0             0 100 i
*> 1.1.7.0/30       10.1.2.1                 0             0 100 i
*> 1.1.8.0/29       10.1.2.1                 0             0 100 i
*> 1.1.9.0/28       10.1.2.1                 0             0 100 i
*> 1.1.10.0/27      10.1.2.1                 0             0 100 i
*> 1.1.11.0/26      10.1.2.1                 0             0 100 i
*> 1.1.12.0/25      10.1.2.1                 0             0 100 i
*> 10.1.2.0/24      0.0.0.0                  0         32768 i
*                   10.1.2.1                 0             0 100 i
*  10.1.4.0/24      10.2.3.3                               0 300 400 i
*>                  10.1.2.1                 0             0 100 i
*  10.2.3.0/24      10.2.3.3                 0             0 300 i
*>                  0.0.0.0                  0         32768 i
*  10.3.4.0/24      10.1.2.1                               0 100 400 i
*>                  10.2.3.3                 0             0 300 i
R2#
R2#
R2#
R2#wr
Building configuration...
[OK]
R2#
R2#
R2#
R2#
